[
  {
<<<<<<< Updated upstream
    "path": "posts/2021-12-18-dealing-with-images-in-r/",
=======
    "path": "posts/2021-12-18-1-dealing-with-images-in-r/",
>>>>>>> Stashed changes
    "title": "Dealing with Images in R",
    "description": "A walkthrough of dealing with images in R and creating a custom image gallery.",
    "author": [
      {
        "name": "Jimmy Briggs",
        "url": {}
      }
    ],
    "date": "2021-12-18",
    "categories": [],
<<<<<<< Updated upstream
    "contents": "\nWhile developing and designing software projects in R it is very common to have to deal with various images and the process of manipulating, re-sizing, cropping, and dealing with these images can be a huge pain and waste of time.\nExamples of Pain Point with Images\nSome examples of the pain points when dealing with images are:\nDealing with image formats and file extensions\nHaving to remove backgrounds from images to make them transparent\nResizing images to fit properly into your webapp\nCreating thumbnails and icons from the image for various design layouts\netc.\nThe magick Package\nRecently I finally decided to take a gander into the popular magick R library.\nThis package is a swiss-army-knife for dealing with images in R.\nA good place to start is the image_resize function which allows you to resize the dimensions of your images. To add to that, let’s create a function allowing one to:\nRead in an image file: magick::image_read\nResize that image: magick::image_resize\nSave the image back to file: magick::image_write\n\n\n\nCreating a Gallery of Images\n\n\n\nSpice up the Gallery with Custom CSS and Javascript\nlightgallery.js\nHTML Head needs:\n<head>\n\n<link type=\"text/css\" rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.0/css/lightgallery.min.css\" />\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/lightgallery-js/1.4.1-beta.0/js/lightgallery.min.js\"><\/script>\n\n<!-- lightgallery plugins -->\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/lg-fullscreen/1.2.1/lg-fullscreen.min.js\"><\/script>\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/lg-thumbnail/1.2.1/lg-thumbnail.min.js\"><\/script>\n\n<\/head>\nPlus the following CSS customization:\n#lightgallery > a > img:hover {\n   transform: scale(1.15, 1.15);\n   transition: 0.4s ease-in-out;\n   cursor: pointer;\n}\nResult\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-18T18:38:52+00:00",
=======
    "contents": "\r\nWhile developing and designing software projects in R it is very common to have to deal with various images and the process of manipulating, re-sizing, cropping, and dealing with these images can be a huge pain and waste of time.\r\nExamples of Pain Point with Images\r\nSome examples of the pain points when dealing with images are:\r\nDealing with image formats and file extensions\r\nHaving to remove backgrounds from images to make them transparent\r\nResizing images to fit properly into your webapp\r\nCreating thumbnails and icons from the image for various design layouts\r\netc.\r\nThe magick Package\r\nRecently I finally decided to take a gander into the popular magick R library.\r\nThis package is a swiss-army-knife for dealing with images in R.\r\nA good place to start is the image_resize function which allows you to resize the dimensions of your images. To add to that, let’s create a function allowing one to:\r\nRead in an image file: magick::image_read\r\nResize that image: magick::image_resize\r\nSave the image back to file: magick::image_write\r\n\r\n\r\n\r\nCreating a Gallery of Images\r\n\r\n\r\n\r\nSpice up the Gallery with Custom CSS and Javascript\r\nlightgallery.js\r\nHTML Head needs:\r\n<head>\r\n\r\n<link type=\"text/css\" rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.0/css/lightgallery.min.css\" />\r\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/lightgallery-js/1.4.1-beta.0/js/lightgallery.min.js\"><\/script>\r\n\r\n<!-- lightgallery plugins -->\r\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/lg-fullscreen/1.2.1/lg-fullscreen.min.js\"><\/script>\r\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/lg-thumbnail/1.2.1/lg-thumbnail.min.js\"><\/script>\r\n\r\n<\/head>\r\nPlus the following CSS customization:\r\n#lightgallery > a > img:hover {\r\n   transform: scale(1.15, 1.15);\r\n   transition: 0.4s ease-in-out;\r\n   cursor: pointer;\r\n}\r\nResult\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-18T13:22:57-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-12-18-2-r-package-developer-essentials/",
    "title": "R Package Developer Essentials",
    "description": "A walkthrough of the various packages, tools, resources, and axioms I have \nencountered over my years as an R package sofware engineer.",
    "author": [
      {
        "name": "Jimmy Briggs",
        "url": "https://devfolio.jimbrig.com"
      }
    ],
    "date": "2021-12-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nPre-Requisite Readings\r\nPackage Development Fundamentals\r\n\r\nPeople who program using the R language can be separated into two core buckets:\r\nR Developers\r\nR Users\r\nTo distinguish, R developers develop new innovative solutions while R Users use the tools and packages that the developers created. This article is aimed towards the development side of the spectrum and attempts to provide a comprehensive, curated toolbox for the R Developer, specifically in regard to developing R Packages.\r\nPre-Requisite Readings\r\nTo start, R package developers need to be familiar with the fundamentals of package development, and therefore should be familiar with some of the highest regarded resources available to read.\r\nAnyone who is serious about developing production grade R packages needs to be familiar with most of, if not all of the following resources and guides:\r\n\r\n\r\nTable 1: R Package Developer Essential Resources\r\n\r\n\r\nResource\r\n\r\n\r\nSource\r\n\r\n\r\nWriting R Extensions\r\n\r\n\r\nCRAN Manuals\r\n\r\n\r\nR Packages\r\n\r\n\r\nHadley Wickham\r\n\r\n\r\nR Package Primer\r\n\r\n\r\nKarl Broman\r\n\r\n\r\nPackage Guidelines\r\n\r\n\r\nBioconductor\r\n\r\n\r\nrOpenSci Packages Developer Guide\r\n\r\n\r\nrOpenSci\r\n\r\n\r\n\r\nView Citations\r\n\r\n(Wickham and Bryan, n.d.a, n.d.b; “Why Package and Environment Management Is Critical for Serious Data Science,” n.d.a, n.d.b; Vidoni, n.d.; Initiative, n.d.; “An Introduction to Packager,” n.d.; Gandrud 2015; Glennie 2020; “Owen-TheRGuide.pdf,” n.d.; Riederer, n.d.; Spector 2004; Team, n.d.; Zhu and Jianan, n.d.)\r\n\r\nWriting R Extensions Manual\r\nThe Writing R Extensions Manual is perhaps the most crucial resource listed above, and has even been considered the Bible of R Package Development.\r\nHowever, it is very exhaustive and not the most visually-appealing write-up.\r\nAs Hadley puts it in his book Writing R Packages: (Wickham and Bryan, n.d.c)\r\n\r\n“The best resource for the official details of package development is always the official writing R extensions manual. However, this manual can be hard to understand if you’re not already familiar with the basics of packages. It’s also exhaustive, covering every possible package component, rather than focusing on the most common and useful components, as this book does. Writing R extensions is a useful resource once you’ve mastered the basics and want to learn what’s going on under the hood.”\r\n\r\n— Hadley Wickham\r\n\r\nThanks to Colin Fay, a more elegant version of the original manual has been created as a bookdown site and published online at https://colinfay.me/writing-r-extensions.\r\nThis resource is highly encouraged for anyone taking R Package Development seriously.\r\nNote: The other manuals listed on the CRAN Manuals website contain a lot of hidden gems that are often overlooked by R developers. These resources contain some of the most crucial, foundational knowledge that anyone using R should eventually be made aware of, therefore I highly recommend you check those out in addition to Writing R Extensions.\r\nPackage Development Fundamentals\r\nR Package development can be broken down into the following fundamental areas of development:\r\n\r\n\r\n\r\n“An Introduction to Packager.” n.d. https://cran.r-project.org/web/packages/packager/vignettes/An_Introduction_to_packager.html.\r\n\r\n\r\nGandrud, Christopher. 2015. Reproducible Research with r and RStudio. Second edition. Chapman & Hall/CRC the r Series. Boca Raton: CRC Press, Taylor & Francis Group.\r\n\r\n\r\nGlennie, Richard. 2020. “Reproducible Research with r and RStudio by Christopher Gandrud.” Journal of Agricultural, Biological and Environmental Statistics, 12.\r\n\r\n\r\nInitiative, Environmental Data. n.d. Best Practices for Data Package Design. https://ediorg.github.io/data-package-best-practices/datapackage-design/index.html.\r\n\r\n\r\n“Owen-TheRGuide.pdf.” n.d. https://cran.r-project.org/doc/contrib/Owen-TheRGuide.pdf.\r\n\r\n\r\nRiederer, Yihui Xie, Christophe Dervieux, Emily. n.d. R Markdown Cookbook. https://bookdown.org/yihui/rmarkdown-cookbook/.\r\n\r\n\r\nSpector, Phil. 2004. “An Introduction to r.” University of California, Berkeley. https://www.stat.berkeley.edu/~spector/R.pdf.\r\n\r\n\r\nTeam, R. Core. n.d. Writing r Extensions. https://colinfay.me/writing-r-extensions/index.html.\r\n\r\n\r\nVidoni, rOpenSci software review editorial team (current and alumni): Brooke Anderson, Scott Chamberlain, Laura DeCicco, Julia Gustavsen, Jeff Hollister, Anna Krystalli, Mauro Lepore, Lincoln Mullen, Karthik Ram, Emily Riederer, Noam Ross, Maëlle Salmon, Adam Sparks, Melina. n.d. rOpenSci Packages: Development, Maintenance, and Peer Review. https://devguide.ropensci.org/.\r\n\r\n\r\n“Why Package and Environment Management Is Critical for Serious Data Science.” n.d.a. https://blog.rstudio.com/2020/08/20/why-package-environment-management-is-critical-for-serious-data-science/.\r\n\r\n\r\n———. n.d.b. https://blog.rstudio.com/2020/08/20/why-package-environment-management-is-critical-for-serious-data-science/.\r\n\r\n\r\nWickham, Hadley, and Jennifer Bryan. n.d.c. R Packages. https://r-pkgs.org/.\r\n\r\n\r\n———. n.d.a. R Packages. https://r-pkgs.org/.\r\n\r\n\r\n———. n.d.b. R Packages. https://r-pkgs.org/.\r\n\r\n\r\nZhu, Yang Feng, and Jianan. n.d. R Programming: Zero to Pro. https://r02pro.github.io/.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-18T21:23:13-05:00",
>>>>>>> Stashed changes
    "input_file": {}
  },
  {
    "path": "posts/2021-12-11-experimenting-with-caching-backends-in-r/",
    "title": "Experimenting with Caching Backends in R",
    "description": "Take a look at some of the more advanced, modern ways of utilizing backend caching with hosted applications or workflows.",
    "author": [
      {
        "name": "Jimmy Briggs",
        "url": "https://github.com/jimbrig"
      }
    ],
    "date": "2021-12-11",
    "categories": [],
    "contents": "\nIntroduction\nThe R ecosystem provides an assortment of options and libraries for implementing caching into one’s data-related workflows, for example:\nmemoise\ncachem\nRcache\ncacher\nstorr\nplus many others.\nHowever, there seems to be a slight lack in support for caching with regard to cloud hosted workflows and web applications.\nTypical Web Application’s Architecture\nAs an example, take a typical web-application architecture where the process is segmented into three separate layers:\n This generalized architecture is deemed the Three-Tier Architecture and is a model generally used by app developers to create flexible and reusable applications.\nBroken down, the three layers are:\nPresentation Layer - the interface the end-user interacts with. Its primary duty is to translate tasks and results from servers into output that the end-user can understand. In short, this tier is the User Interface or client.\nApplication Layer - primary coordinator of the back-end of the application. This tier processes commands, makes logical decisions and processes data between the end user-interface and the back-end database. In short, this tier is the business logic.\nData Layer - simply put, this tier is where data is stored and accessed by the application layer. This tier composes of the various data stores needed by the application to access and retrieve data used in both previously mentioned layers, i.e. databases and cloud storage.\nA benefit of the three-tier architecture is that each layer can work and be maintained, developed, and tested in isolation, independent of the other layers. Therefore every time the application queries for data, the speed is limited by network performance.\nData retrieval time plays a key role in overall user experience (UX) and is a critical requirement for most large applications meant for production.\nDatabase Caching Overview\nCaching is a buffering technique that stores frequently-queried data in a temporary memory. It makes data easier to be accessed and reduces workloads for databases. For example, you need to retrieve a user’s profile from the database and you need to go from a server to server. After the first time, the user profile is stored next (or much nearer) to you. Therefore, it greatly reduces the time to read the profile when you need it again.\nThe cache can be set up in different tiers or on its own, depending on the use case. It works with any type of database including both Relational and NoSQL Databases.\nBenefits of Caching\nPerformance — Performance is improved by making data easier to be accessed through the cache and reduces workloads for database.\nScalability — Workload of back-end query is distributed to the cache system which is lower costs and allow more flexibility in processing of data.\nAvailability — If back-end database server is unavailable, cache can still provide continuous service to the application, making the system more resilient to failures.\nOverall, it is the minimally invasive strategy to improve application performance by implementing caching with additional benefits of scalability and availability.\nThere are many implementations of caching in modern application frameworks including:\nCache Aside\nRead Through\nWrite Through\nWrite Back\nWrite Around\nFor example here is an architectural diagram of the Cache Aside workflow:\n\nOk so now moving onto caching in relation to R:\nCaching in Shiny\nRecently, the shiny package introduced new functions that aid in caching: bindCache and renderCachedPlot.\nrenderCachedPlot() requires shiny version 1.5.0 or higher.\nbindCache() requires shiny version 1.6.0 or higher.\nAdding a Cache Layer Between Application and Database\nRedis is the most commonly used back-end for implementing a caching layer between the application and database in production, and it is pretty awesome.\nOne can easily spin up a local Redis backend using docker as follows:\ndocker run --rm --name redisbank -d -p 6379:6379 redis:5.0.5 --requirepass bebopalula\nThis will run a redis container at localhost exposed to port 6379 (Redis’ typical port).\nNext, you can add a redis cache to your R workflow using a generated R6 object that represents the redis_cache created with the bank package in conjunction with the memoise package as so:\nNote: the redux package will be required to implement the redis_cache R6 object here\nlibrary(bank)\nlibrary(memoise)\n\nredis_cache <- bank::cache_redis$new(password = \"bebopalula\")\n\nf <- function(x) {\n  sample(1:1000, x)\n}\n\nmf <- memoise::memoise(f, cache = redis_cache)\n\nmf(5)\n\nmf(10)\nand inside Shiny:\nui <- fluidPage(\n  # Creating a slider input that will be used as a cache key\n  sliderInput(\"nrow\", \"NROW\", 1, 32, 32),\n  # Plotting a piece of mtcars\n  plotOutput(\"plot\")\n)\n\nserver <- function(input, output, session) {\n  output$plot <- renderCachedPlot(\n    {\n      # Pretending this takes a long time\n      Sys.sleep(2)\n      plot(mtcars[1:input$nrow, ])\n    },\n    cacheKeyExpr = list(\n      # Defining the cache key\n      input$nrow\n    ),\n    # Using our redis cache\n    cache = redis_cache\n  )\n}\nshinyApp(ui, server)\nFor a more involved shiny example you could use:\ngenerate_app(redis_cache)\nTry it Out!\n\n\n\n",
    "preview": "posts/2021-12-11-experimenting-with-caching-backends-in-r/images/caching.jpg",
    "last_modified": "2021-12-18T18:38:51+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-12-07-searching-from-r/",
    "title": "Searching from R",
    "description": "'Utilize advanced searching techniques to quickly launch a search from R'",
    "author": [
      {
        "name": "Jimmy Briggs",
        "url": "https://github.com/jimbrig"
      }
    ],
    "date": "2020-12-07",
    "categories": [],
    "contents": "\n\nContents\nIntroduction\nYour Mind is a CPU\n\nSearching from R\nIdentifying an Opportunity\nReviewing Current Processes\nDeveloping a Solution\nSetting up the Search Engines\nExamples\n\nR Code\nGeneral Search Engine\nSearch Github\nRseek.org\nSearch R Site via Finzi\nSearch Nabble R Forum\nSearch Google\nSearch R Project Domain via Google\nSearch METACRAN\n\nConcluding Remarks\n\n\n\n  function codefolder(query) {\n\n    var x = document.querySelectorAll(query);\n    if (x.length === 0) return;\n\n    function toggle_vis(o) {\n      var d = o.style.display;\n      o.style.display = (d === 'block' || d === '') ? 'none':'block';\n    }\n\n    for (i = 0; i < x.length; i++) {\n      var y = x[i];\n      toggle_vis(y);\n    }\n\n    var elem = document.getElementById(\"codefolder-button\");\n    if (elem.value === \"Hide Code\") elem.value = \"Show Code\";\n    else elem.value = \"Hide Code\";\n  }\n\n  window.addEventListener('load', function () {\n    codefolder('d-code');\n  });\n\nIntroduction\nSkip to the R code examples.\nProgrammers are good at engineering software and designing web applications. I argue that we can apply the same logic to facilitate an environment which provides a natural, orchestrated flow between the various activities we undertake, both online and in the console.\nIn this post I use searching the web, a process developers rely on heavily for many different reasons, as a basic example of an area for improvement.\nI will show you some examples of querying specific search engines directly from your R console as well as provide some pre-configured functions for some of my most common use-cases.\nBefore showcasing the code, first I want to bring to light some ideas surrounding our daily workflows as developers and how we interact with the web.\nYour Mind is a CPU\n\n“The optimal number of threads in any system is one thread.” - Scott Hanselman\n\nThink of your mind as a CPU (central processing unit) like that on your computer. Each separate task you pursue throughout the day relies on a limited amount of resources, which can be thought of as your bank of availableRandom Access Memory, or RAM.\nFrom this perspective, the idea of multi-tasking becomes multi-threading, and as developers we all know that for computers to run asynchronous, parallel, multi-threaded processes requires a highly intricate, well designed, and deeply thought out infrastructure to work properly without overloading the CPU and crashing the machine.\nSimilarly, switching contexts between different digital environments causes your mind to have to continuously re-adjust and reboot its underlying resources in order to facilitate the influx of new information in need of being processed.\nIn other words, it takes time, energy, and resources to get your mind to focus, and every time we switch tasks or contexts, we lose energy that wouldn’t have been lost if we had just stayed in one context initially. The fatigue that builds up from all of this energy loss can potentially demotivate us, as well as cause mental burnout.\nProgrammers should strive to reach a state of flow in which complete focus can be given to one activity.\nThis requires determination and discipline in order to keep that focus streamlined as well as a proper environment which motivates focus instead of scattered, distracted thought.\nThe solution to avoiding burnout and unproductive programming habits is to provide an ecosystem where context switching is minimized and when needed, streamlined.\nSearching from R\nIdentifying an Opportunity\nHave you ever wanted to search google directly from R? What about query your organizations Github repos or search for packages on your respective CRAN mirror?\nThis thought never crossed my mind until I took a second to think about the potential benefits of constructing a system for implementing this in R.\nThe problem I found was two-fold:\nSearching the web for R specific resources can be frustrating, time-consuming, and difficult.\nThe process of switching contexts from R to the browser is unproductive and breaks my natural development flow.\nIdentifying these issues, I took it as an opportunity to create something new, and potentially beneficial to others as we developers love to do.\nReviewing Current Processes\nAlthough most R developers are extensively familiar with The DRY Principle (Don’t repeat yourself) in programming, many do not attempt to extend the principle outside of their code.\nThinking on the principle further, I realized that the amount of time developers interact with the web through a web browser interface is much larger than we may think and is only growing as our dependence on online services and learning resources increase exponentially.\nFor me, the idea of searching from your command prompt or terminal stemmed from my repetitive need to search online for some form of information whilst in the midst of a programming endeavor. While there are many amazing API’s, SDK’s, and localized web-oriented frameworks allowing developers to interact with the web from their console, I found myself in need of a more general, simplistic approach to querying information hosted online from my local machine.\nOnce I stopped to think about my daily processes while developing locally and interacting with the internet, I quickly realized that there is a much larger frequency of instances where I am in need of browsing the web than I originally would have anticipated. Whether navigating to my web browser to google a new concept, review a Github pull request, or even launch a locally hosted shiny application, I found that I use my browsers constantly throughout the day.\nTo name a few examples:\nReviewing a new pull request on Github or searching my backlog of issues assigned to me\nSearching for new software or downloading a new version\nSearching my cloud storage drives for files or data\nSearching my emails for important information\nReviewing online documentation when learning something new\nRetrieving a forgotten API Key or account password\nChecking on and maintaining a hosted cloud service platform\nWatching a demo video on youtube for a new application\nChecking my RSS feeds and developer blogs to stay up to date on current news\nSearching google for a new library, concept, or framework\nAs you can see, there are a variety of instances where interacting with and querying the web has become a routine in our daily development workflows and learning processes.\nAdditionally, due to the lack of a more streamlined, self-contained approach to this reliance on the web while programming, I found myself easily distracted my all of the bells and whistles the internet and my browsers have to offer. Between all of the bookmarks, feeds, notifications and variety of browser extensions the simple process of leaving your code and opening your browser has much larger implications than most people realize.\nWhile this may seem like a minimal interruption to your programming workflow, the fact of the matter is that programming is a form of work which requires a very deep, specific environment and mindset in order to keep your development pipelines productive and efficient. In other words, programming is not easy and requires intense focus.\nTherefore, developers should do everything they can to avoid having to switch in and out of the various shallow contexts surrounding our everyday lives while attempting to perform a session of productive coding.\nDeveloping a Solution\nBrowser Search Engines\nTo provide a simple, yet powerful solution to the issues surrounding browsing the internet for necessary resources, I started with my personal browser settings.\nMost web browser providers facilitate a setting where you can configure your own custom configurations for creating search queries to specific web sites using your address bar.\nFor example, in Chrome if you navigate to Settings > Manage Search Engines you will see a list of default search engine providers such as google, bing, and yahoo as well as some auto-generated engines created by websites you have visited in the past such as Youtube or Medium.\nWhat most people do not realize is they can add add their own search engines and keywords also.\nFor example, if I want to search Github repositories querying with a specific keyword while filtering for only repositories categorized with the language R the query URL would be: https://github.com/search?q=%slanguage%3Ar.\nYou can produce this yourself by searching from Github and applying the filters yourself and replacing the term you searched for with %s, similar to the sprintf context. Lastly, assign a keyword of ghr and test it out by typing ghr in your address bar and pressing tab or enter. Now when you search it will direct you to Github R repositories!\nExample: Search Github for tidyverse with keyword ghr filtering for Language:R:\n\nnote that this is setup with the following in chrome://settings/searchEngines:\n\nBuilding on this framework I setup in my browser years ago, I decided to take it one step further by bringing the searching functionality to my personal R package browsr focusing on R-specific search engines (it can be quite difficult to search effectively for R resources filtering out everything else given R is only one letter).\nSetting up the Search Engines\nFor setting up the search engines all I needed to do was migrate my browser customized search engine URL’s into R by wrapping them in R functions which pass the %s syntax as a function argument.\nHere is a list of the search engines I have implemented so far and their functions:\nGeneral Search Function\nSearch Github\nSearch RSeek.org\nSearch Finzi’s R Site\nSearch the R Forum on Nabble\nSearch Google\nSearch R-Project Domain from Google\nSearch METACRAN\nExamples\nHere is a list of some common examples:\nGmail: https://mail.google.com/mail/ca/u/0/#apps/%s\nYouTube: https://www.youtube.com/results?search_query=%s&page={startPage?}&utm_source=opensearch\nFacebook: https://www.facebook.com/search/top/?q=%s&opensearch=1\nTwitter: https://twitter.com/search?q=%s\nSoundCloud: https://soundcloud.com/search?q=%s\nAmazon: https://www.amazon.in/s/ref=nb_sb_noss_2?url=search-alias%3Daps&field-keywords=%s\nSome may find it useful to create custom github queries for their Github accounts:\nYour personal Github repositories: https://github.com/<GITHUB_USERNAME>?tab=repositories&q=%s\nYour organizations Github repositories: https://github.com/search?q=org%3A<GITHUB_ORGANIZATIoN>+%s\nExample Tables\nGeneral\nSearch Engine\nKeyword\nQuery URL\nEdge Settings\nsettings\nedge://settings/?search=%s\nEdge History\nhist\nedge://history/all?q=%s\nGmail Inbox Search\ngmail\nhttps://inbox.google.com/search/%s\nGoogle Drive\ngdrive\nhttps://drive.google.com/drive/u/0/search?q=%s\nGithub\ngh\nhttps://github.com/search?q=%s&ref=opensearch\nGithub Gist\ngist\nhttps://gist.github.com/search?q=&ref=opensearch\nStackOverFlow\nstackoverflow\nhttps://stackoverflow.com/search?q=%s\nDev.to\ndevto\nhttps://dev.to/search?q=%s\nDevDocs\ndevdocs\nhttps://devdocs.io/#q=%s\nDeveloper Resources\nAnd some more general developer resources:\nSearch Engine\nKeyword\nQuery URL\nGithub\ngh\nhttps://github.com/search?q=%s&ref=opensearch\nGithub Gist\ngist\nhttps://gist.github.com/search?q=&ref=opensearch\nStackOverFlow\nstackoverflow\nhttps://stackoverflow.com/search?q=%s\nDev.to\ndevto\nhttps://dev.to/search?q=%s\nDevDocs\ndevdocs\nhttps://devdocs.io/#q=%s\nMozilla WebDocs\nmozdocs\nhttps://developer.mozilla.org/en-US/search?q=%s&w=3&qs=plugin\nR-Resources\nThe R-Project Website provides some useful search engines here:\n\n\nTaking these references as a starting point we can create some query URLs for searching R specifically:\nSearch Engine\nKeyword\nQuery URL\nR Site Search by Finzi\nrsite\nhttp://finzi.psych.upenn.edu/cgi-bin/namazu.cgi?query=%s&max=100&result=normal&sort=score&idxname=functions&idxname=views\nRSeek\nrseek\nhttps://www.rseek.org/?q=%s\nR Nabble Forum\nrnabble\nhttps://r.789695.n4.nabble.com/template/NamlServlet.jtp?macro=search_page&node=789695&query=%s\nAdvanced Google Search: R Project\nrproj\nhttps://www.google.com/search?q=%s&domains=r-project.org&sitesearch=r-project.org&btnG=Google+Search\nAdditional R\nAdditionally, I have created these R related search queries as well:\nSearch Engine\nKeyword\nQuery URL\nGithub - Language:R\nghr\nhttps://github.com/search?q=%slanguage%3Ar\nGithub Gist - Language:R\ngistr\nhttps://gist.github.com/search?q=%s+language%3Ar&ref=searchresults\nStackOverFlow - Tag:R\nstackoverflowr\nhttps://stackoverflow.com/search?q=%5Br%5D+%s\nMETACRAN\nmetacran\nhttps://www.r-pkg.org/search.html?q=%s\nDan Goldstein’s Site\ndanr\nhttp://www.dangoldstein.com/search_r.html?cx=partner-pub-8815643643661420%3Al9jc9v-e2vi&cof=FORID%3A10&ie=ISO-8859-1&q=%s&sa=Search&siteurl=www.dangoldstein.com%2Fsearch_r.html&ref=search.r-project.org%2F&ss=265j35153j3\nR Documentation\nrdocs\nhttp://rdocumentation.org/\nR Package Documentation - Packages\nrdrrpkg\nhttps://rdrr.io/find/?repos=cran%2Cbioc%2Crforge%2Cgithub&fuzzy_slug=%s\nRStudio Website\nrstudio\nhttps://rstudio.com/#stq=%s&stp=1\nR-Bloggers\nrbloggers\nhttps://cse.google.com/cse?cx=005359090438081006639%3Apaz69t-s8ua&ie=UTF-8&q=%s&sa=Go\nR Code\nOnline Reference: https://jimbrig.github.io/browsr/reference/search.html\nGeneral Search Engine\n\n\n#' Generalized Search and Search Engine Examples\n#'\n#' Use these functions to search the web directly from your browser,\n#' building advanced queries and supplying common useful R related domains.\n#'\n#' @param s string to search for (`%s` in the query URL)\n#' @param query_url string representing the URL to query; defaults to Google\n#'\n#' @name search\n#'\n#' @keywords search_engines\n#'\n#' @export\n#'\n#' @examples\n#' library(browsr)\n#' # default search on google\n#' search_online(\"polished.tech\")\n#'\n#' # search github (note: &ref=opensearch)\n#' search_online(\"polished\", \"https://github.com/search?q=%s&ref=opensearch\")\n#'\n#' # search Github with language:r, org:tychobra for 'polished' (note: '%3A' represents a ':')\n#' search_online(\"polished\", \"https://github.com/search?q=%s+language%3Ar+org%3Atychobra\")\nsearch_online <- function(s,\n                          query_url = \"https://google.com/search?q=\") {\n\n  url <- paste0(query_url, s)\n\n  utils::browseURL(url)\n\n}\n\n\n\nSearch Github\n\n\n#' Search Github\n#'\n#' Query Github's internal search engine.\n#'\n#' @param s string to search for\n#' @param type what to search for, see details for options\n#' @param language optional language filter\n#' @param topic optional topic filter\n#' @param user optional user filter\n#' @param org optional org filter\n#'\n#' @describeIn search\n#'\n#' @export\n#'\n#' @examples\n#' search_gh(\"websocket\", language = \"r\", topic = \"rshiny\")\n#'\n#' # search your org\n#' search_gh(\"polished\", org = \"tychobra\")\nsearch_gh <- function(s,\n                      type = \"all\",\n                      language = NULL,\n                      topic = NULL,\n                      user = NULL,\n                      org = NULL) {\n\n  types <- c(\"all\",\n             \"repo\",\n             \"code\",\n             \"commit\",\n             \"issue\",\n             \"discussion\",\n             \"package\",\n             \"marketplace\",\n             \"topic\",\n             \"wiki\",\n             \"user\")\n\n  match.arg(type, types)\n  type_query <- ifelse(type == \"all\", \"&ref=opensearch\", paste0(\"&type=\", type))\n  base_url <- \"https://github.com/search?q=\"\n  lang_query <- ifelse(is.null(language), \"\", paste0(\"+language%3A\", language))\n  topic_query <- ifelse(is.null(topic), \"\", paste0(\"+topic%3A\", topic))\n  user_query <- ifelse(is.null(user), \"\", paste0(\"+user%3A\", user))\n  org_query <- ifelse(is.null(org), \"\", paste0(\"org%3A\", org))\n  query <- paste0(s, \" \", lang_query, topic_query, user_query, org_query, type_query)\n\n  url <- paste0(base_url, query)\n\n  utils::browseURL(url)\n\n}\n\n\n\nRseek.org\n\n\n#' Search RSeek.org\n#'\n#' Query a search on [rseek.org](https://rseek.org/).\n#'\n#' @param s string to search for\n#' @export\n#'\n#' @describeIn search\n#'\n#' @references\n#' - <http://www.sashagoodman.com/>\nsearch_rseek <- function(s) {\n  url <- paste0(\"http://www.rseek.org/?q=\", s)\n  utils::browseURL(url)\n}\n\n\n\nSearch R Site via Finzi\n\n\n#' Search Finzi\n#'\n#' @param s string to search for\n#'\n#' @describeIn search\n#'\n#' @references\n#' - <http://finzi.psych.upenn.edu/search.html>\n#' - <http://finzi.psych.upenn.edu/search/manual.html#query>\n#'\n#' @export\nsearch_finzi <- function(s) {\n\n  url <- paste0(\n    \"http://finzi.psych.upenn.edu/cgi-bin/namazu.cgi?query=\",\n    s,\n    \"&max=100&result=normal&sort=score&idxname=functions&idxname=views\"\n  )\n\n}\n\n\n\nSearch Nabble R Forum\n\n\n#' Search Nabble R Forum\n#'\n#' Query a search on the R Nabble Forum. Nabble is an innovative search engine\n#' for R messages.\n#'\n#' @describeIn search\n#'\n#' @param s string to search for\n#'\n#' @export\n#' @references\n#' - <https://cloud.r-project.org/search.html>\n#' - <http://n4.nabble.com/help/Answer.jtp?id=31>\nsearch_nabble <- function(s) {\n\n  url <- paste0(\n    \"https://r.789695.n4.nabble.com/template/NamlServlet.jtp?macro=search_page&node=789695&query=\", s\n  )\n\n  utils::browseURL(url)\n\n}\n\n\n\nSearch Google\n\n\n#' Search Google\n#'\n#' @describeIn search\n#'\n#' @param s string to search for\n#' @export\nsearch_google <- function(s) {\n  url <- paste0(\"https://www.google.com/search?q=\", s)\n  utils::browseURL(url)\n}\n\n\n\nSearch R Project Domain via Google\n\n\n#' Search R Project Domain on Google\n#'\n#' @param s string to search for\n#'\n#' @describeIn search\n#'\n#' @export\n#'\n#' @details See <https://cloud.r-project.org/search.html> which showcases Google's\n#'   advanced search feature to query only R-Project domain sites via the\n#'   [Google Search Engine](http://www.google.com/advanced_search).\nsearch_rproject <- function(s) {\n\n  url <- paste0(\n    \"https://www.google.com/search?q=\", s,\n    \"&domains=r-project.org&sitesearch=r-project.org&btnG=Google+Search\"\n  )\n\n  utils::browseURL(url)\n\n}\n\n\n\nSearch METACRAN\n\n\n#' Search METACRAN\n#'\n#' @param s string to search for\n#'\n#' @describeIn search\n#'\n#' @export\nsearch_metacran <- function(s) {\n\n  url <- paste0(\n    \"https://www.r-pkg.org/search.html?q=\", s)\n\n  utils::browseURL(url)\n\n}\n\n\n\nConcluding Remarks\nDownload the source code from the Github Repository.\nAlthough I do use other terminals, languages, and shells outside of the R environment, most of my development work is done within R and RStudio. Therefore, I chose R as my framework for implementing a set of utility functions to quickly perform advanced search queries online from a wide variety of search engine source domains.\nSimilar R Packages:\nsearcher\nwebsearcher\npackageFinder\ntools::CRAN_package_db() from the tools package\n\n\n\n",
    "preview": "posts/2020-12-07-searching-from-r/images/magnifying_glass.jpg",
    "last_modified": "2021-12-18T18:38:51+00:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Jim's Docs",
    "description": "Welcome to our new blog, Jim's Docs. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-07",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-18T18:38:52+00:00",
    "input_file": {}
  }
]
